run/icoPhaseChangeVoF/testScalarTransport/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;

    div(phi,alpha)  Gauss interfaceCompression vanLeer 1;

    divScheme           Gauss limitedLinear 1;
    div(rhoPhi,U)       $divScheme;
    div(rhoPhiCp,T)     $divScheme;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;

    // for phaseScalarTransport
    div(alphaPhi,heat) $divScheme;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
